In [276]:
import pandas as pd
import numpy as np
import seaborn

### `merge` 함수를 통한 데이터프레임 병합
`merge()` 메서드로 공통 열 혹은 행을 기준으로 두 개의 데이터프레임을 병합 할 수 있음  
병합의 기준이 되는 열 혹은 행을 `키`라고 함  

기본적으로 `merge()` 메서드는 **inner join** 형태를 가짐  
**outer(full), left, right** 형태로 변경하고 하고자 한다면 `how`인수에 조인 방식을 지정함  
`merge()` 메서드로 병합을 할려 한다면, 동일한 이름의 열 또는 행이 존재해야 한다.

In [277]:
df1 = pd.DataFrame(
    {
        '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
        '이름': ['둘리', ' 도우너', '또치', '길동', '희동', '마이콜', '영희']
    }, columns = [ '고객번호', '이름' ])
df1

   고객번호    이름
0  1001    둘리
1  1002   도우너
2  1003    또치
3  1004    길동
4  1005    희동
5  1006   마이콜
6  1007    영희

In [278]:
df2 = pd.DataFrame(
    {
        '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
        '금액': [10000, 2000, 15000, 5000, 100000, 3000]
    }, columns = ['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001    2000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001    3000

In [279]:
# merge함수로 두 데이터 프레임의 공통 열인 고객번호를 기준으로 데이터가 합쳐진다.
pd.merge(df1, df2)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리   2000
2  1001   둘리   3000
3  1005   희동  15000
4  1006  마이콜   5000

In [280]:
pd.merge(df1, df2, how='outer') # 키 값이 한쪽에만 있어도 출력 됨 (NaN)이 하나만 있으면 출력 됨.

   고객번호    이름        금액
0  1001    둘리   10000.0
1  1001    둘리    2000.0
2  1001    둘리    3000.0
3  1002   도우너       NaN
4  1003    또치       NaN
5  1004    길동       NaN
6  1005    희동   15000.0
7  1006   마이콜    5000.0
8  1007    영희       NaN
9  1008   NaN  100000.0

In [281]:
pd.merge(df1, df2, how='left')

   고객번호    이름       금액
0  1001    둘리  10000.0
1  1001    둘리   2000.0
2  1001    둘리   3000.0
3  1002   도우너      NaN
4  1003    또치      NaN
5  1004    길동      NaN
6  1005    희동  15000.0
7  1006   마이콜   5000.0
8  1007    영희      NaN

In [282]:
pd.merge(df1, df2, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리    2000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리    3000

만약 키 값에 동일한 데이터가 여러개 존재한다면 모든 경우의 수를 표현함

In [283]:
df1 = pd.DataFrame(
    {
        '품종': ['튤립', '튤립', '장미', '장미'],
        '꽃잎길이': [1.4, 1.3, 1.5, 1.3]
    }
)
df1

   품종  꽃잎길이
0  튤립   1.4
1  튤립   1.3
2  장미   1.5
3  장미   1.3

In [284]:
df2 = pd.DataFrame(
    {
        '품종': ['튤립', '장미', '장미', '무궁화'],
        '꽃잎너비': [0.4, 0.3, 0.5, 0.3]
    }
)
df2

    품종  꽃잎너비
0   튤립   0.4
1   장미   0.3
2   장미   0.5
3  무궁화   0.3

In [285]:
pd.merge(df1, df2)

   품종  꽃잎길이  꽃잎너비
0  튤립   1.4   0.4
1  튤립   1.3   0.4
2  장미   1.5   0.3
3  장미   1.5   0.5
4  장미   1.3   0.3
5  장미   1.3   0.5

In [286]:
pd.merge(df1, df2, how='outer')

    품종  꽃잎길이  꽃잎너비
0  무궁화   NaN   0.3
1   장미   1.5   0.3
2   장미   1.5   0.5
3   장미   1.3   0.3
4   장미   1.3   0.5
5   튤립   1.4   0.4
6   튤립   1.3   0.4

병합되는 두 데이터프레임의 동일한 컬럼명이 여러개 존재한다면 모두 키가 되기 때문에  
특정한  컬럼만 키로 사용하고자 한다면 `on`인수로 지정해야함

In [287]:
df1 = pd.DataFrame(
    {
        '이름': ['춘향', '몽룡', '춘향'],
        '날짜': ['20180101', '20180102', '20180102'],
        '데이터': [20000, 30000, 100000]
    }
)
df1

   이름        날짜     데이터
0  춘향  20180101   20000
1  몽룡  20180102   30000
2  춘향  20180102  100000

In [288]:
df2 = pd.DataFrame(
    {
        '이름': ['춘향', '몽룡'],
        '데이터': ['여', '남']
    }
)
df2

   이름 데이터
0  춘향   여
1  몽룡   남

In [289]:
# pd.merge(df1, df2, on='성명')

In [290]:
pd.merge(df1, df2, on='이름')   # on 으로 기준열 명시, 값이 명시적으로 나온 값만 출력

   이름        날짜   데이터_x 데이터_y
0  춘향  20180101   20000     여
1  몽룡  20180102   30000     남
2  춘향  20180102  100000     여

키가 되는 기준열의 이름이 서로 다르면 `left_on`, `right_on` 인수에 사용할 키 컬럼 이름을 지정함

In [291]:
df1 = pd.DataFrame(
    {
        '이름': ['춘향', '몽룡', '춘향'],
        '날짜': ['20180101', '20180102', '20180102']
    }
)
df1

   이름        날짜
0  춘향  20180101
1  몽룡  20180102
2  춘향  20180102

In [292]:
df2 = pd.DataFrame(
    {
        '성명': ['춘향', '몽룡', '길동'],
        '데이터': ['여', '남', '남']
    }
)
df2

   성명 데이터
0  춘향   여
1  몽룡   남
2  길동   남

In [293]:
pd.merge(df1, df2, left_on='이름', right_on='성명')

   이름        날짜  성명 데이터
0  춘향  20180101  춘향   여
1  몽룡  20180102  몽룡   남
2  춘향  20180102  춘향   여

In [294]:
df1 = pd.DataFrame(
    {
        '도시': ['서울', '서울', '서울', '부산', '부산'],
        '연도': [2000, 2005, 2010, 2000, 2005],
        '인구': [980, 970, 960, 360, 350]
    }
)
df1

   도시    연도   인구
0  서울  2000  980
1  서울  2005  970
2  서울  2010  960
3  부산  2000  360
4  부산  2005  350

In [295]:
df2 = pd.DataFrame(
    np.arange(12).reshape((6,2)),
    index = [
        ['부산', '부산', '서울', '서울', '서울', '서울'],
        [2000, 2005, 2000, 2005, 2010, 2015]
    ],
    columns = ['데이터1', '데이터2']
    )
df2

         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11

In [296]:
pd.merge(df1, df2, left_on=['도시', '연도'], right_index=True)

   도시    연도   인구  데이터1  데이터2
0  서울  2000  980     4     5
1  서울  2005  970     6     7
2  서울  2010  960     8     9
3  부산  2000  360     0     1
4  부산  2005  350     2     3

#### `join` 메서드
데이터프레임 인스턴스에 사용할 땐 `merge` 메서드 대신에 `join` 메서드를 사용

In [297]:
df1.join(df2, on=['도시', '연도'])

   도시    연도   인구  데이터1  데이터2
0  서울  2000  980     4     5
1  서울  2005  970     6     7
2  서울  2010  960     8     9
3  부산  2000  360     0     1
4  부산  2005  350     2     3

<aside>
<img src="https://noticon-static.tammolo.com/dgggcrkxq/image/upload/v1574221064/noticon/xjal9z4a8h46soi6ktgo.png" alt="https://noticon-static.tammolo.com/dgggcrkxq/image/upload/v1574221064/noticon/xjal9z4a8h46soi6ktgo.png" width="40px" /> **파이썬으로 다음 연산을 수행한다.**

두 개의 데이터프레임을 만들고 merge 명령으로 합친다. 단 데이터프레임은 다음 조건을 만족해야 한다.

1. 각각 5 x 5 이상의 크기를 가진다.
2. 공통 열을 하나 이상 가진다. 다만 공통 열의 이름은 서로 다르다.   (해보자)
</aside>

### `concat` 메서드로 데이터 연결
기준 열 지정없이 단순히 데이터를 연결하고자 할 땐 `concat()` 메서드를 사용함  
기본적으로 위아래로 행을 연결하기 때문에 인덱스가 중복될 수 있음  
만약 좌우로 열을 연결하고 싶을 때는 `axis=1` 인수를 사용한다.

In [298]:
s1 = pd.Series([0,1], index=['A', 'B'])
s1

A    0
B    1
dtype: int64

In [299]:
s2 = pd.Series([2, 3, 4], index=['A', 'B', 'C'])
s2

A    2
B    3
C    4
dtype: int64

In [300]:
pd.concat([s1, s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [301]:
df1 = pd.DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['데이터1', '데이터2']
)
df1

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [302]:
df2 = pd.DataFrame(
    np.arange(4).reshape(2, 2),
    index=['b', 'c'],
    columns=['데이터3', '데이터4']
)
df2

   데이터3  데이터4
b     0     1
c     2     3

In [303]:
pd.concat([df1, df2], axis=1)   # pd.concat으로 df1, df2를 붙이는데 axis=1 로 인해 열만 연결이 된다.(axis=0 은 행.)

   데이터1  데이터2  데이터3  데이터4
a     0     1   NaN   NaN
b     2     3   0.0   1.0
c     4     5   2.0   3.0

##### 파이썬으로 다음 연산을 수행한다.

어느 회사의 전반기(1월 ~ 6월) 실적을 나타내는 데이터프레임과 후반기(7월 ~ 12월) 실적을 나타내는 데이터프레임을 만든 뒤 합친다. 실적 정보는 “매출”, “비용”, “이익” 으로 이루어진다. (이익 = 매출 - 비용).

또한 1년간의 총 실적을 마지막 행으로 덧붙인다.

In [304]:
df3 = pd.DataFrame(
    {
        '매출': [10000, 11000, 9000, 12000, 13000, 8000],
        '비용': [9000, 9500, 9000, 10000, 11000, 10000],
        '이익': [1000, 1500, 0, 2000, 2000, -2000]},
        index = ['1', '2', '3', '4', '5', '6']
    
)
df3

      매출     비용    이익
1  10000   9000  1000
2  11000   9500  1500
3   9000   9000     0
4  12000  10000  2000
5  13000  11000  2000
6   8000  10000 -2000

In [305]:
df4 = pd.DataFrame(
    {
        '매출': [9000, 10000, 12000, 9000, 10000, 11000],
        '비용': [10000, 12000, 10000, 9000, 9000, 9500],
        '이익': [-1000, -2000, 2000, 0, 1000, 1500]
    }, index = ['7', '8', '9', '10', '11', '12']
)
df4

       매출     비용    이익
7    9000  10000 -1000
8   10000  12000 -2000
9   12000  10000  2000
10   9000   9000     0
11  10000   9000  1000
12  11000   9500  1500

In [306]:
df5 = pd.concat([df3, df4])
df5

       매출     비용    이익
1   10000   9000  1000
2   11000   9500  1500
3    9000   9000     0
4   12000  10000  2000
5   13000  11000  2000
6    8000  10000 -2000
7    9000  10000 -1000
8   10000  12000 -2000
9   12000  10000  2000
10   9000   9000     0
11  10000   9000  1000
12  11000   9500  1500

In [307]:
df5.loc['총실적', :] = df5.sum()
df5

           매출        비용      이익
1     10000.0    9000.0  1000.0
2     11000.0    9500.0  1500.0
3      9000.0    9000.0     0.0
4     12000.0   10000.0  2000.0
5     13000.0   11000.0  2000.0
6      8000.0   10000.0 -2000.0
7      9000.0   10000.0 -1000.0
8     10000.0   12000.0 -2000.0
9     12000.0   10000.0  2000.0
10     9000.0    9000.0     0.0
11    10000.0    9000.0  1000.0
12    11000.0    9500.0  1500.0
총실적  124000.0  118000.0  6000.0

### 피봇 테이블
**피봇 테이블** : 데이터에 이미 존재하는 기본 열을 행 인덱스와 열 인덱스로 사용하는 테이블  

pandas에서 피봇테이블을 만들기 위해서는 `pivot()` 메서드를 사용할 수 있음  
`pivot` 메서드에는 `index`인수로 행 인덱스로 사용할 열을 지정, `columns` 인수로 열 인덱스로 사용할 열을 지정, `values` 인수로 표현할 데이터를 지정

In [308]:
df1 = pd.DataFrame(
    {
        '도시': ['서울', '서울', '서울', '부산', '부산', '부산', '인천', '인천'],
        '연도': [2000, 2005, 2010, 2000, 2005, 2010, 2005, 2010],
        '인구': [980, 970, 960, 360, 350, 350, 250, 260],
        '지역': ['수도권', '수도권', '수도권', '경상권', '경상권', '경상권', '수도권', '수도권']
    }
)
df1

   도시    연도   인구   지역
0  서울  2000  980  수도권
1  서울  2005  970  수도권
2  서울  2010  960  수도권
3  부산  2000  360  경상권
4  부산  2005  350  경상권
5  부산  2010  350  경상권
6  인천  2005  250  수도권
7  인천  2010  260  수도권

In [309]:
df1.pivot(index='도시', columns='연도', values='인구')  # 기본적으로 오름차순으로 출력됨.

연도   2000   2005   2010
도시
부산  360.0  350.0  350.0
서울  980.0  970.0  960.0
인천    NaN  250.0  260.0

행 인덱스나 열 인덱스를 리스트로 전달하면 다중 인덱스 피봇 테이블로 생성할 수 있음

In [310]:
df1.pivot(index=['지역', '도시'], columns='연도', values='인구')

연도       2000   2005   2010
지역  도시
경상권 부산  360.0  350.0  350.0
수도권 서울  980.0  970.0  960.0
    인천    NaN  250.0  260.0

행 인덱스와 열 인덱스 조건에 만족하는 데이터가 2개 이상 존재한다면 피봇 테이블을 생성할 수 없음

In [311]:
# df1.pivot(index='지역', columns="연도", values="인구")    에러뜨는게 맞음

### 그룹 분석
데이터가 그룹을 이룰 때 그룹의 특성을 보여주는 분석 방법  
그룹 분석은 피봇테이블과는 다르게 키게 의해서 결정되는 데이터가 여러 개 있을 경우 미리 지정한 연산을 통해서 해당 그룹의 대표 값을 계싼한다.

#### `group by` 메서드
`group by` 메서드는 그룹 별로 분류하여 그룹 객체를 생성하는 메서드  
그룹 객체는 그룹 연산 메서드를 포함하고 있음

#### 그룹 연산 메서드
- `size()`, `count()`: 그룹 데이터의 갯 수  
- `mean()`, `median()`, `min()`, `max()`: 그룹 데이터의 평균, 중앙값, 최소값, 최대값  
- `sum()`, `prod()`, `std()`, `var()`, `quantile()`: 그룹 데이터의 합계, 곱, 표준편차, 분산, 사분위수  
-  `first()`, `last()`: 그룹 데이터의 처음 값, 마지막 값

( 많이 사용되는 것 )
- `agg()`, `aggregate()`: 그룹 연산 메서드를 직접 생성하여 사용하도록 하는 메서드, 여러가지 그룹연산을  
                                            동시에 하려할 때 해당 그룹 연산을 리스트로 전달하여 사용하도록 하는 메서드  

- `describe()`: 하나의 대표값이 아니라 여러개의 값을 데이터프레임으로 구하는 메서드  
- `apply()`: 하나의 대표값이 아니라 여러 개의 값을 데이터프레임으로 구하는데 원하는 그룹 연산이 없을 때 메서드를 직접 생성하여 사용하도록하는   메서드  
- `transform()`: 대표값을 생성하는 것이 아니라 데이터 자체를 변경하는 메서드

In [312]:
df2 = pd.DataFrame(
    {
        'key1': ['A', 'A', 'B', 'B', 'A'],
        'key2': ['one', 'two', 'one', 'two', 'one'],
        'data1': [1, 2, 3, 4, 5],
        'data2': [10, 20, 30, 40, 50]
    }
)
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [313]:
dg = df2.groupby(df2.key1) 
dg

In [314]:
dg.groups

{'A': [0, 1, 4], 'B': [2, 3]}

In [315]:
dg.sum()    # 더하기

           key2  data1  data2
key1
A     onetwoone      8     80
B        onetwo      7     70

In [316]:
df2.data2

0    10
1    20
2    30
3    40
4    50
Name: data2, dtype: int64

In [317]:
df2.groupby(df2.key1).sum()

           key2  data1  data2
key1
A     onetwoone      8     80
B        onetwo      7     70

In [318]:
df2.groupby(df2.key1)[['data1', 'data2']].sum()

      data1  data2
key1
A         8     80
B         7     70

In [319]:
df2.groupby(df2.key1).sum().data1

key1
A    8
B    7
Name: data1, dtype: int64

##### 파이썬으로 다음 연산을 수행한다.
key1의 값을 기준으로 data1의 값을 분류하여 합계를 구한 결과를 시리즈가 아닌 데이터프레임으로 구한다.

In [320]:
df2.groupby(df2.key1)

In [321]:
df2.groupby(df2.key1).sum()[['data1']]

      data1
key1
A         8
B         7

두 개 이상의 열을 기준으로 그룹 분석을 하고자 하면 `groupby` 메서드에 리스트 형태로 키를 전달하면 됨

In [322]:
df2.groupby([df2.key1, df2.key2]).sum()

           data1  data2
key1 key2
A    one       6     60
     two       2     20
B    one       3     30
     two       4     40

In [323]:
df2.data1.groupby([df2.key1, df2.key2]).sum().unstack('key2')

key2  one  two
key1
A       6    2
B       3    4

In [324]:
df1['인구'].groupby(df1['지역']).mean()

지역
경상권    353.333333
수도권    684.000000
Name: 인구, dtype: float64

In [333]:
iris = seaborn.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [326]:
def peak_to_peak_ratio(group_row):
    return group_row.max() / group_row.min()

iris.groupby(iris.species).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [327]:
iris.groupby(iris.species).describe()

           sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.428  ...        1.575  1.9        50.0  0.246
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.105386  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

In [328]:
iris.groupby(iris.species).describe().T # T로 데이터 프레임을 뒤짚는다.

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

In [329]:
def top3_petal_length(df):
    return df.sort_values(by='petal_length', ascending=False)[:3]   # 내림차순 정렬, 3개만 출력

iris.groupby(iris.species).groups

{'setosa': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49], 'versicolor': [50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99], 'virginica': [100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]}

In [330]:
def top3_petal_length(df):
    return df.sort_values(by='petal_length', ascending=False)[:3]   # 내림차순 정렬, 3개만 출력

iris.groupby(iris.species).apply(top3_petal_length)

C:\Users\ITPS\AppData\Local\Temp\ipykernel_10752\3293600186.py:4: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  iris.groupby(iris.species).apply(top3_petal_length)

                sepal_length  sepal_width  petal_length  petal_width  \
species
setosa     24            4.8          3.4           1.9          0.2
           44            5.1          3.8           1.9          0.4
           23            5.1          3.3           1.7          0.5
versicolor 83            6.0          2.7           5.1          1.6
           77            6.7          3.0           5.0          1.7
           72            6.3          2.5           4.9          1.5
virginica  118           7.7          2.6           6.9          2.3
           117           7.7          3.8           6.7          2.2
           122           7.7          2.8           6.7          2.0

                   species
species
setosa     24       setosa
           44       setosa
           23       setosa
versicolor 83   versicolor
           77   versicolor
           72   versicolor
virginica  118   virginica
           117   virginica
           122   virginica

In [332]:
def q3cut(s):
    return pd.qcut(s, 3, labels=["소", "중", "대"]).astype(str)

iris["petal_length_class"] = iris.groupby(iris.species).petal_length.transform(q3cut)
iris[["petal_length", "petal_length_class"]].head(10)

   petal_length petal_length_class
0           1.4                  소
1           1.4                  소
2           1.3                  소
3           1.5                  중
4           1.4                  소
5           1.7                  대
6           1.4                  소
7           1.5                  중
8           1.4                  소
9           1.5                  중

#### 파이썬으로 다음 연산을 수행한다.

붓꽃(iris) 데이터에서 붓꽃 종(species)별로 꽃잎길이(sepal_length), 꽃잎폭(sepal_width) 등의 평균을 구하라. 만약 붓꽃 종(species)이 표시되지 않았을 때 이 수치들을 이용하여 붓꽃 종을 찾아낼 수 있을지 생각하라.

In [334]:
iris.groupby(iris.species).mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026